tutorials/dyMFoam/cylPiston/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: dualFuelEngline addition to OpenFOAM v7
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.4-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection       50;

inlet           25;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

mInjection      #calc "-1.0*$injection";

mInlet          #calc "-1.0*$inlet";

boundaryField
{
/* Injection */
    injectionXm
    {
        type            fixedValue;
        value           uniform ($mInjection 0 0);

    }
    injectionXp
    {
        type            fixedValue;
        value           uniform ($injection 0 0);
    }

/* Inlet */
    inletXm
    {
        type            fixedValue;
        value           uniform ($mInlet 0 0);
    }
    inletXp
    {
        type            fixedValue;
        value           uniform ($inlet 0 0);
    }
    inletYm
    {
        type            fixedValue;
        value           uniform (0 $mInlet 0);
    }
    inletYp
    {
        type            fixedValue;
        value           uniform (0 $inlet 0);
    }

/* Outlet */
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

/* Walls */
    "piston|valve|walls"
    {
        type            slip;
    }

/* ACMI patches */
    "(inner|outer)ACMI(1|2)_blockage"
    {
        type            slip;
    }
    "(inner|outer)ACMI(1|2)_couple"
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
