tutorials/dyMFoam/cylPiston/0/nut.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
/* Inlet */
    "(injection|inlet)(X|Y)(m|p)"
    {
        type            fixedValue;
        value           $internalField;
    }

/* Outlet */
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

/* Walls */
    "piston|valve|walls"
    {
        type            zeroGradient;
    }

/* ACMI patches */
    "(inner|outer)ACMI(1|2)_blockage"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    "(inner|outer)ACMI(1|2)_couple"
    {
        type            cyclicACMI;
        value           $internalField;
    }
}


// ************************************************************************* //
