tutorials/dyMFoam/cylPiston/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

m4 < system/blockMeshDict.m4 > system/blockMeshDict

runApplication blockMesh

runApplication topoSet -constant

# Split the mesh to generate the ACMI coupled patches
runApplication createBaffles -overwrite


#------------------------------------------------------------------------------