tutorials/dyMFoam/cylPiston/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: dualFuelEngline addition to OpenFOAM v7
   \\    /   O peration     | Website:  https://github.com/StasF1/dualFuelEngine
    \\  /    A nd           | Version:  0.4-alpha
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dyMFoam;//pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.48;

deltaT          0.009;//1e-04;

writeControl    adjustableRunTime;

writeInterval   0.0018;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression false;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.5;

// ************************************************************************* //
